const product = [
  {
     id: '110',
     name: '绿帽成人礼',
        items: [
            {
                id: '112',
                name: '1-绿帽成人礼全篇'
            },
            {
                id: '113',
                name: '番外一'
            },
            {
                id: '114',
                name: '番外二'
            },
            {
                id: '115',
                name: '独立番外上'
            },
            {
                id: '116',
                name: '独立番外下'
            },
            {
                id: '117',
                name: '番外三'
            },
            {
                id: '118',
                name: '番外四'
            },
            {
                id: '119',
                name: '番外五'
            }
     ]
    },  
    {
     id: '120',
     name: '老驴头',
        items: [
            {
                id: '121',
                name: '老驴头全本'
            },
            {
                id: '122',
                name: '老驴头（续篇）'
            },
            {
                id: '123',
                name: '老驴头（再续）'
            },
            {
                id: '124',
                name: '	番外一'
            },
            {
                id: '125',
                name: '	番外二'
            }
     ]
    },
    {
     id: '125',
     name: '黑疫之下的绿帽魔都',
        items: [
            {
                id: '127',
                name: '黑疫之下的绿帽魔都（正文）'
            },
            {
                id: '128',
                name: '续篇'
            },
            {
                id: '129',
                name: '再续篇'
            }
     ]
    },
    {
     id: '130',
     name: '完篇合集系列',
        items: [
            {
                id: '131',
                name: '哥布林与绿帽首富的淫妻们（全篇配图版）'
            },
            {
                id: '132',
                name: '穿越过去（全本）'
            },
            {
                id: '133',
                name: '武圣的炼狱（全本）'
            },
            {
                id: '134',
                name: '中华小正太和他的贱奴大洋马们（全本）'
            },
            {
                id: '135',
                name: '天后巨星沦为大屌黑人毒贩的受精母狗'
            },
            {
                id: '136',
                name: '母狗妈妈（全篇）'
            },
            {
                id: '137',
                name: '至高女帝（全本）'
            },
            {
                id: '138',
                name: '至高三女帝 （全本）'
            },
            {
                id: '139',
                name: '黑皮前女友与大白马老婆的淫欲人生'
            }
     ]
    },
    {
     id: '140',
     name: '妈妈的耻辱遭遇【配图版】',
        items: [
            {
                id: '141',
                name: '第一章'
            }
     ]
    },  
    {
     id: '142',
     name: '无能狂怒的人生',
        items: [
            {
                id: '143',
                name: 'P1'
            }
     ]
    },  
    {
     id: '144',
     name: '安艺伦也',
        items: [
            {
                id: '145',
                name: 'P1'
            },
            {
                id: '146',
                name: 'P2'
            }
     ]
    },  
    {
     id: '147',
     name: '催眠那些慕洋骚丝浪蹄',
        items: [
            {
                id: '148',
                name: 'P1'
            },
            {
                id: '149',
                name: 'P2'
            }
     ]
    },  
    {
     id: '150',
     name: '绿帽GPT',
        items: [
            {
                id: '151',
                name: 'P1'
            }
     ]
    }
]
const authorLinkPath = 'KT6598'
const baseUrl = "http://93.179.96.220:8070"
